"""
Напишите программу, которая решает квадратные уравнения даже если
дискриминант отрицательный.
Используйте комплексные числа
для извлечения квадратного корня.
"""
a = int(input("Введите a:\n"))
b = int(input("Введите b:\n"))
c = int(input("Введите c:\n"))

d = b ** 2 - 4 * a * c
if d > 0:
    root1 = (-b + d ** 0.5) / (2 * a)
    root2 = (-b - d ** 0.5) / (2 * a)
    print("Два корня:", root1, "и", root2)
elif d == 0:
    root = -b / (2 * a)
    print("Один корень:", root)
else:
    d = complex(d)
    root1 = (-b + d ** 0.5) / (2 * a)
    root2 = (-b - d ** 0.5) / (2 * a)
    print("Два комплексных корня:", root1, "и", root2)
