""" Создайте несколько переменных разных типов.
Проверьте к какому типу относятся созданные переменные. """
a = 5
b = 5.1
c = "HELLOW"
d = {a, b, c}
e = [1, 2, 3]
print(type(a), type(b), type(c), type(d), type(e))